snlkuharlocal/src/Documents/ЗаявкаНаПерепаковку/ЗаявкаНаПерепаковку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПерепаковку</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СпайкиВПути</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовности</name>
    <comment>Дата готовности</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ДвижениеТовараВнешнегоКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПерепаковку</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящееПРМТовар</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящееПРМРасходныеМатериалы</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящееПРМТовар</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящееПРМРасходныеМатериалы</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеНедостачи</name>
    <type>
      <types>DocumentRef.СписаниеТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектация</name>
    <type>
      <types>DocumentRef.Комплектация</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходнаяНакладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделятьРасходныеМатериалыВОтдельноеПРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладыОстатков</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходныеМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ПланОтгрузок/ПланОтгрузок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланОтгрузок</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/МинимальныеОстаткиНаСкладах/МинимальныеОстаткиНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МинимальныеОстаткиНаСкладах</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/СпайкиВПути/СпайкиВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СпайкиВПути</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыЗаявокНаПерепаковку/СтатусыЗаявокНаПерепаковку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаПерепаковку</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПолученаСкладом</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоНаПерепаковку</name>
  </enumValues>
  <enumValues>
    <name>КомплектуетсяНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>КомплектуетсяУПартнёров</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отработана</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаПерепаковку/ObjectModule.bsl
///////////// ЗАПОЛНЕНИЕ /////////////////////////////////////////////////////////////

Процедура ЗаполнитьНоменклатуру() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаГотовности));
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланОтгрузокОбороты.Номенклатура КАК Номенклатура,
	|	ПланОтгрузокОбороты.Склад КАК Склад
	|ПОМЕСТИТЬ ТЗНоменклатура
	|ИЗ
	|	РегистрНакопления.ПланОтгрузок.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК ПланОтгрузокОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланОтгрузокОбороты.Номенклатура,
	|	ПланОтгрузокОбороты.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МинимальныеОстаткиНаСкладахСрезПоследних.Номенклатура,
	|	МинимальныеОстаткиНаСкладахСрезПоследних.Склад
	|ИЗ
	|	РегистрСведений.МинимальныеОстаткиНаСкладах.СрезПоследних(&НачалоПериода, ) КАК МинимальныеОстаткиНаСкладахСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальныеОстаткиНаСкладахСрезПоследних.Номенклатура,
	|	МинимальныеОстаткиНаСкладахСрезПоследних.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗНоменклатура.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТЗНоменклатура КАК ТЗНоменклатура
	|ГДЕ
	|	ТЗНоменклатура.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗНоменклатура.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТЗНоменклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Товары.Очистить();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоНаПерепаковку() Экспорт
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаГотовности));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК СвободныйОстаток
	|ПОМЕСТИТЬ СвободныеОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&НачалоПериода,
	|			Номенклатура = &Номенклатура
	|				И Склад = &Склад) КАК ОстаткиТМЦОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				&НачалоПериода,
	|				Номенклатура = &Номенклатура
	|					И Склад = &Склад) КАК РезервыТМЦОстатки
	|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|			И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТМЦОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныеОстаткиНаСкладахСрезПоследних.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(МинимальныеОстаткиНаСкладахСрезПоследних.Количество, 0)) КАК МинКоличество
	|ПОМЕСТИТЬ МинОстатки
	|ИЗ
	|	РегистрСведений.МинимальныеОстаткиНаСкладах.СрезПоследних(
	|			&НачалоПериода,
	|			Номенклатура = &Номенклатура
	|				И Склад = &Склад) КАК МинимальныеОстаткиНаСкладахСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальныеОстаткиНаСкладахСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланОтгрузокОбороты.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ПланОтгрузокОбороты.КоличествоОборот, 0)) КАК ПланОтгрузки
	|ПОМЕСТИТЬ ПланыОтгрузок
	|ИЗ
	|	РегистрНакопления.ПланОтгрузок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			Номенклатура = &Номенклатура
	|				И Склад = &Склад) КАК ПланОтгрузокОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланОтгрузокОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпайкиВПутиОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(СпайкиВПутиОстатки.КоличествоОстаток, 0)) КАК СпайкиОстаток
	|ПОМЕСТИТЬ СпайкиВПути
	|ИЗ
	|	РегистрНакопления.СпайкиВПути.Остатки(&КонецПериода, Номенклатура = &Номенклатура) КАК СпайкиВПутиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	СпайкиВПутиОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыОтгрузок.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(МинОстатки.МинКоличество, 0) - ЕСТЬNULL(СвободныеОстатки.СвободныйОстаток, 0) + ЕСТЬNULL(ПланыОтгрузок.ПланОтгрузки, 0) - ЕСТЬNULL(СпайкиВПути.СпайкиОстаток, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ПланыОтгрузок.Номенклатура.ШтукВКомплекте <> 0
	|			ТОГДА ПланыОтгрузок.Номенклатура.ШтукВКомплекте
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПланыОтгрузок.Номенклатура.Родитель.ШтукВКомплекте <> 0
	|					ТОГДА ПланыОтгрузок.Номенклатура.Родитель.ШтукВКомплекте
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПланыОтгрузок.Номенклатура.Родитель.Родитель.ШтукВКомплекте <> 0
	|							ТОГДА ПланыОтгрузок.Номенклатура.Родитель.Родитель.ШтукВКомплекте
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ПланыОтгрузок.Номенклатура.ШтукВКоробке <> 0
	|			ТОГДА ПланыОтгрузок.Номенклатура.ШтукВКоробке
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПланыОтгрузок.Номенклатура.Родитель.ШтукВКоробке <> 0
	|					ТОГДА ПланыОтгрузок.Номенклатура.Родитель.ШтукВКоробке
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПланыОтгрузок.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|							ТОГДА ПланыОтгрузок.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КратностьКомплекта
	|ИЗ
	|	ПланыОтгрузок КАК ПланыОтгрузок
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвободныеОстатки КАК СвободныеОстатки
	|		ПО ПланыОтгрузок.Номенклатура = СвободныеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ МинОстатки КАК МинОстатки
	|		ПО ПланыОтгрузок.Номенклатура = МинОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпайкиВПути КАК СпайкиВПути
	|		ПО ПланыОтгрузок.Номенклатура = СпайкиВПути.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СвободныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МинОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПланыОтгрузок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СпайкиВПути";
	
	Для Каждого Стр ИЗ Товары Цикл
		
		Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Стр, Выборка);
			Если Выборка.Количество <= Выборка.КратностьКомплекта Тогда
				Стр.Количество = Выборка.КратностьКомплекта;
			Иначе // ДОПОЛНИТЬ ДО КРАТНОСТИ
				Если Выборка.Количество % Выборка.КратностьКомплекта = 0 Тогда
					КоличествоИтерацийДеления = Окр(Выборка.Количество / Выборка.КратностьКомплекта, 0, РежимОкругления.Окр15как10);
				Иначе
				    КоличествоИтерацийДеления = Окр(Выборка.Количество / Выборка.КратностьКомплекта, 0, РежимОкругления.Окр15как10) + 1;
				КонецЕсли;
				Для й = 1 По КоличествоИтерацийДеления Цикл
					Если Выборка.Количество <= Выборка.КратностьКомплекта * й Тогда
						Стр.Количество = Выборка.КратностьКомплекта * й;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКомплектующие() Экспорт
	
	Если Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Комплектующие.Очистить();
	
	Для Каждого СтрокаТоваров Из Товары Цикл	
		
		Если СтрокаТоваров.Количество = 0 Тогда 
			Продолжить; 
		КонецЕсли; 
		
		Номенклатура = СтрокаТоваров.Номенклатура;
		
		Если Номенклатура.Коплектующие.Количество() > 0 
			//++Данилова Е.В. 05.02.2025
			И Номенклатура.ВидКомплекта <> Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
			//--Данилова Е.В. 05.02.2025 
			// комплект
			Для Каждого СтрокаКомплекта Из Номенклатура.Коплектующие Цикл
				Если СтрокаКомплекта.Количество = 0 Тогда 
					Продолжить; 
				КонецЕсли; 
				
				СтрокаТЧ = Комплектующие.Добавить();	
				
				СтрокаТЧ.Продукция		= Номенклатура;
				СтрокаТЧ.Номенклатура	= СтрокаКомплекта.Номенклатура;
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, ЭтотОбъект);
				
				СтрокаТЧ.Количество		= СтрокаКомплекта.Количество * СтрокаТоваров.Количество;
				СтрокаТЧ.КоличествоПродукции = СтрокаТоваров.Количество;
				
			КонецЦикла; 
		Иначе			
			// обычный товар
			СтрокаТЧ = Комплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТоваров);
			СтрокаТЧ.Продукция = Номенклатура;
			СтрокаТЧ.КоличествоПродукции = СтрокаТоваров.Количество;
			
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

// Шворобей ВЮ 29.11.2022 ++
Функция ПостобработкаКомплектующих() Экспорт
	
	//// ВОТ ЗДЕСЬ РАЗБЕРЕМСЯ С КОЛИЧЕСТВОМ ЗАПЧАСТЕЙ /////////////////////////
		
	МассивПродукции = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(Комплектующие.ВыгрузитьКолонку("Продукция"));
		
	Для Каждого Продукция ИЗ МассивПродукции Цикл
		НайденныеСтроки = Комплектующие.НайтиСтроки(Новый Структура("Продукция", Продукция));
		Если НайденныеСтроки.Количество() > 1 Тогда
			счетчикТовара = 0;
			Для Каждого СтрокаТЧ ИЗ НайденныеСтроки Цикл
				Если ПолучитьРеквизитШапки(СтрокаТЧ.Номенклатура,"Родитель.ВидНоменклатуры")= Перечисления.ВидыНоменклаутры.Товар Тогда
					Если счетчикТовара > 0 Тогда
						СтрокаТЧ.КоличествоПродукции = 0;
					КонецЕсли;                                      
					счетчикТовара = счетчикТовара + 1;             
				Иначе
					СтрокаТЧ.КоличествоПродукции = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
	Для Каждого СтрокаТЧ ИЗ Комплектующие Цикл
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);	
	КонецЦикла;
	
КонецФункции
// Шворобей ВЮ 29.11.2022 ++

//////////// СТАНДАРТНЫЕ /////////////////////////////////////////////////////////////

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		ЕстьИзменения	= Модифицированность();	
		НужноВыгружать	= НужноВыгружатьДокумент(ЕстьИзменения, Ссылка, РежимЗаписи, ПометкаУдаления);
		
		//Кухарь А.Ю.  30.11.2022 начало
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
			если Статус=Перечисления.СтатусыЗаявокНаПерепаковку.Закрыта тогда
				НужноВыгружать=ложь;
			КонецЕсли;
		КонецЕсли;
		//Кухарь А.Ю.  30.11.2022 конец
		
		Если НужноВыгружать Тогда
			УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		КонецЕсли;
		
		// Шворобей ВЮ 29.11.2022 ++
		Если ДополнительныеСвойства.Свойство("СтатусВРаботе") Тогда
			Статус = Перечисления.СтатусыЗаявокНаПерепаковку.ВРаботе;
		ИначеЕсли ТолькоТоварыВТабличнойЧасти(Товары) Тогда
			Статус = Перечисления.СтатусыЗаявокНаПерепаковку.Закрыта;
		КонецЕсли;
		
		Если ДатаГотовности <> ПолучитьРеквизитШапки(Ссылка, "ДатаГотовности") Тогда
			Адрес = СокрЛП(Автор.ФизЛицо.ЕМэйл);
			Если Адрес <> "" Тогда
				СписокПолучателей = Новый СписокЗначений;
				СписокПолучателей.Добавить(Адрес);
				ТемаПисьма = "У документа " + Строка(Ссылка) + " установлена дата готовности " + Строка(ДатаГотовности);
				ОшибкиУведомления = СформироватьВнутреннееУведомление(СписокПолучателей, ТемаПисьма, ТемаПисьма);
			КонецЕсли;
		КонецЕсли;
		// Шворобей ВЮ 29.11.2022 ++
		
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
			
			// 1.Проверяется, что во всех строчках товаров заполнен склад.
			
			Для Каждого Стр ИЗ Товары Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Склад) Тогда
					СообщитьИзМодуля("В строке " + Строка(Стр.НомерСтроки) + " не заполнен Склад!");
					Отказ = Истина; Возврат;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Шворобей ВЮ 25.11.2022 ++
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если Статус = Перечисления.СтатусыЗаявокНаПерепаковку.Закрыта Тогда
		Адрес = СокрЛП(Автор.ФизЛицо.ЕМэйл);
		Если Адрес <> "" Тогда
			СписокПолучателей = Новый СписокЗначений;
			СписокПолучателей.Добавить(Адрес);
			ТемаПисьма = "Закрыта заявка на перепаковку " + Строка(Ссылка) + " Можно создавать РНК";
			ТекстПисьма = ТемаПисьма;
			ОшибкиУведомления = СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТемаПисьма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// Шворобей ВЮ 25.11.2022 ++

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если НЕ Отказ Тогда
		
		// ++ Шворобей ВЮ 26.04.2022
		ДвиженияПоРегистрам = Неопределено;
		РезультатПроведения = ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам);
		Если РезультатПроведения.ТОшибок = Неопределено Тогда
			ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам, Истина, Истина);
		ИначеЕсли ТипЗнч(РезультатПроведения.ТОшибок) = Тип("ТаблицаЗначений") Тогда
			ВывестиТрассировку(РезультатПроведения.ТОшибок, РезультатПроведения.Результат);
			Отказ = Истина;
		КонецЕсли;
		// ++ Шворобей ВЮ 26.04.2022
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Если Статус <> Перечисления.СтатусыЗаявокНаПерепаковку.ВРаботе Тогда
			Если Товары.Количество() > 0 Тогда
				Движения.СпайкиВПути.Записывать = Истина;
				Движения.СпайкиВПути.Очистить();
				Для Каждого ТекСтрокаТовары Из Товары Цикл
					Движение = Движения.СпайкиВПути.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Регистратор = Ссылка;
					Движение.Заявка = Ссылка;
					Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
					Движение.Количество = ТекСтрокаТовары.Количество;
				КонецЦикла;
				Движения.СпайкиВПути.Записать(Истина);
			КонецЕсли;
		Иначе
			Движения.СпайкиВПути.Записывать = Истина;
			Движения.СпайкиВПути.Очистить();
			Движения.СпайкиВПути.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать = Ложь, Очищать=Истина)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Продолжить  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];
		Если Очищать Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

// Шворобей ВЮ 29.11.2022 ++
Функция ТолькоТоварыВТабличнойЧасти(ТабЧасть)
	
	Для Каждого Стр ИЗ ТабЧасть Цикл
		Если Стр.Номенклатура.ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито
			ИЛИ Стр.Номенклатура.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект Тогда
				Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции
// Шворобей ВЮ 29.11.2022 ++

//////////////////////////////////////////////////////////////////////////////////////

Процедура ПолучитьОстаткиПоСпискуСкладовЛок(СписокНоменклатуры,СписокСкладов,Накладная,КэшОстатков) Экспорт
	
	Если СписокНоменклатуры.ВГраница()<0 Тогда Возврат КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(СписокСкладов) Тогда Возврат КонецЕсли; 
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Сводный.Номенклатура.Код77 КАК Код77,
	|	Сводный.Номенклатура КАК Номенклатура,
	|	СУММА(Сводный.Остаток) КАК Остаток,
	|	СУММА(Сводный.Резерв) КАК Резерв,
	|	СУММА(Сводный.ВиртуальныйРезерв) КАК ВиртуальныйРезерв
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(Остатки.Номенклатура, Резервы.Номенклатура) КАК Номенклатура,
	|		ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток,
	|		ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК Резерв,
	|		0 КАК ВиртуальныйРезерв
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				,
	|				Склад В (&СписокСкладов)
	|					И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	|			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					,
	|					Склад В (&СписокСкладов)
	|						И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	|			ПО Остатки.Номенклатура = Резервы.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиТМЦ.Номенклатура,
	|		ОстаткиТМЦ.Количество,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|	ГДЕ
	|		ОстаткиТМЦ.Регистратор = &Регистратор
	|		И ОстаткиТМЦ.Склад В(&СписокСкладов)
	|		И ОстаткиТМЦ.ВидДвижения = &Расход
	|		И ОстаткиТМЦ.Номенклатура В(&СписокНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТМЦ.Номенклатура,
	|		0,
	|		-РезервыТМЦ.Количество,
	|		0
	|	ИЗ
	|		РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|	ГДЕ
	|		РезервыТМЦ.Регистратор = &Регистратор
	|		И РезервыТМЦ.Склад В(&СписокСкладов)
	|		И РезервыТМЦ.Номенклатура В(&СписокНоменклатуры)) КАК Сводный
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводный.Номенклатура,
	|	Сводный.Номенклатура.Код77
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сводный.Номенклатура";
	
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);	
	Запрос.УстановитьПараметр("Регистратор",Накладная);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	Запрос.УстановитьПараметр("СписокСкладов",СписокСкладов);
	
	Выборка=Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		КэшОстатков.Вставить(Выборка.Номенклатура,Новый Структура("Остаток,Резерв,СвободныйОстаток,Код77",Выборка.Остаток,Выборка.Резерв,Макс(0,Выборка.Остаток-Выборка.Резерв-Выборка.ВиртуальныйРезерв),Выборка.Код77));	
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьКоэффициентКомплекта(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Номенклатура.ШтукВКомплекте <> 0
	|			ТОГДА Номенклатура.ШтукВКомплекте
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Номенклатура.Родитель.ШтукВКомплекте <> 0
	|					ТОГДА Номенклатура.Родитель.ШтукВКомплекте
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Номенклатура.Родитель.Родитель.ШтукВКомплекте <> 0
	|							ТОГДА Номенклатура.Родитель.Родитель.ШтукВКомплекте
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ * ВЫБОР
	|		КОГДА Номенклатура.ШтукВКоробке <> 0
	|			ТОГДА Номенклатура.ШтукВКоробке
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Номенклатура.Родитель.ШтукВКоробке <> 0
	|					ТОГДА Номенклатура.Родитель.ШтукВКоробке
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|							ТОГДА Номенклатура.Родитель.Родитель.ШтукВКоробке
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КратностьКомплекта
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КратностьКомплекта;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено ИЛИ ДанныеЗаполнения.Пустая() Тогда Возврат КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Внешний = Истина;
	Автор = ПараметрыСеанса.Пользователь;
	
	ДокОснование = ДанныеЗаполнения;
	
	Если ДанныеЗаполнения.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокСсылка", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	*,
		|	&Склад КАК Склад
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокСсылка
		|	И Товары.Количество > 0";
		
		УстановитьПривилегированныйРежим(Истина);
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ДанныеЗаполнения.Метаданные().ТабличныеЧасти.Найти("Комплектующие") <> Неопределено Тогда
		Комплектующие.Загрузить(ДанныеЗаполнения.Комплектующие.Выгрузить());
	КонецЕсли;
	
	Если ДанныеЗаполнения.Метаданные().Имя = "РасходнаяНакладная" Тогда
		ДополнительныеСвойства.Вставить("ПомечатьРНКНаУдаление", Истина);
		ДополнительныеСвойства.Вставить("РазрешитьВводДатыГотовности", Истина);
		ДополнительныеСвойства.Вставить("СтатусВРаботе", Истина)
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
